<template>
    <v-dialog v-model="dialog" width="50%" @click.stop="dialog = true">
      <template v-slot:activator="{ on }">
        <v-btn color="white"
        text
        style="padding-left:0" v-on="on">개인정보처리약관 |</v-btn>
      </template>
  <v-card>
        <v-card-title class="headline"><h1>개인정보처리약관</h1></v-card-title>
        <v-card-text>
            <hr>
            <br>
            <h2>제1조(개인정보의 처리목적)</h2>
            <br>
            <pre>① DEV 42.195은 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 정해진 용도 이외로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
            
가. 포털 사이트 서비스 제공을 위한 회원관리
- 필수 목적
• 공공데이터의 제공 및 활용신청
• 공공데이터 등록/관리를 위한 사용자 관리 등
- 선택 목적
• DEV42.195 및 데이터 활용 관련 정보 제공
• 공공데이터 활용현황 조사
- 선택 목적에 동의하지 않는 경우, 포털 및 데이터 활용 관련 정보 제공과 활용 현황조사 대상에서 제외됩니다.

나. 공공데이터 제공신청 처리
- 공공데이터 제공신청서에 포함된 개인정보는 제공신청 접수 및 처리에 이용
  (공공데이터 제공신청서, 결정 통보서, 제공신청 처리와 관련된 서비스 등)</pre>
  <br>
  <h2>제2조(개인정보의 처리 및 보유기간)</h2>
  <br>
  <pre>
① DEV 42.195은 법령에 따른 개인정보 보유ㆍ이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유ㆍ이용기간 내에서 개인정보를 처리ㆍ보유합니다.

가. DEV 42.195 회원정보
- 수집근거 : 정보주체의 동의
- 보존기간 : 회원 탈퇴 의사 전까지(2년 경과 시 재동의)
- 보존근거 : 정보주체의 동의에 의한 자료수집

나. 공공데이터 제공신청 처리정보
- 수집근거 : 공공데이터의 제공 및 이용활성화에 관한 법률 제27조제1항 및 동법 시행령 제21조
- 보존기간 : 10년
- 보존근거 : 공공기록물 관리에 관한 법률 시행령 제26조 제1항
  </pre>
  <br>
  <h2>제3조(개인정보의 제3자 제공)</h2>
  <br>
  <pre>
① DEV 42.195은 정보주체의 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조에 해당하는 경우에만 개인정보를 제3자(공공데이터 제공기관)에게 제공합니다.

② DEV 42.195은 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.

- 개인정보를 제공 받는 자 : 공공데이터 제공신청을 접수 및 처리하는 공공기관
- 제공받는 자의 개인정보 이용목적 : 공공데이터 제공신청이 있는 경우, 이를 즉시 소관 공공기관에 이첩하기 위함
- 제공하는 개인정보 항목 : 성명(단체명 및 대표자 성명), 생년월일, 주소, 전화번호, 전자우편주소, 사업자(법인, 단체) 등록번호
- 제공근거 : 공공데이터의 제공 및 이용 활성화에 관한 법률 제 27조 제1항 및 동법 시행령 제21조,동법 시행규칙 별지 제 9호 서식
- 제공받는 자의 보유이용기간 : 공공기록물 관리에 관한 법률 시행령 제26조 제1항이 정한 기간
- 신청자는 DEV 42.195에서 수집하는 개인정보의 제3자(공공데이터 제공기관) 제공에 대해 동의를 거부할 권리가 있으며, 미동의 시에는 공공데이터 제공신청이 제한됩니다.
  </pre>



            </v-card-text>
        <v-card-actions style="justify-content: center">
          <v-btn color="black" text @click="dialog = false">Close</v-btn>
        </v-card-actions>
      </v-card>
    </v-dialog>
</template>
<script>
export default {
    components: {
        
    },
    name: 'Policy',
    data() {
        return {
            dialog: false,
        }

    },
    methods: {

    }
}
</script>
<style>
pre{
    background-color: #424242;
    color: white;
    padding:10px;
    overflow: auto;
    white-space: pre-wrap; /* pre tag내에 word wrap */
}  
</style>